'use strict';

//Контроль версий Git — программа для создания репрозиториев 
//GitHub — хранилище репрозиториев

//Установка

//Начать следить за папкой «git init»

//Показать скрытые файлы и папки «shift+command+.»

//Представиться «git cinfig --local user.name "JohnDoe"»
//«git config --local user.email example@mail.com»
//«--local» значит юзер будет прописан только в локальном проекте
//«--global» юзер будет глобально во всех проектах.

//У Гит репрозитория три состояния: 1) создан 2) отслеживание 3) кнтрольная точка commite
//«git status» — посмотреть статус репрозитория

//«git add -A» добавить все файлы в репрозиторий.

//«git commit -a -m"ddescription"» — создание контрольной точки с комментарием

//«git log» — показать про коммиты. (Выводящуюся инфу можно оптимизировать)

//«git remote add origin https://github.com/kenebayev/udemi-js-learning.git» связать локальный репрозиторий с репрозиторием на гитхабе.

//«git push -u origin main» — закачать репрозиторий на гитхаб (запушить)
